In [1]:
import pandas as pd
import numpy as np

# seleksi baris dengan query

In [5]:
df = pd.DataFrame({
    'col1': [1,22,3,53,64],
    'col 2': [34,32,1,5,44]
})
df

   col1  col 2
0     1     34
1    22     32
2     3      1
3    53      5
4    64     44

In [9]:
df.query('col1 == 3')

   col1  col 2
2     3      1

In [7]:
#in case jika nama kolom pakai spasi
df.query('`col 2` > 30')

   col1  col 2
0     1     34
1    22     32
4    64     44

# convert datetime di pandas

In [ ]:
32750842065